backend/app/models/quotation.rb

  def calculate_factory_cost
    self.factory_cost = value * (Setup.first.factory_cost)/100
---
SELECT "setups".* FROM "setups" ORDER BY "setups"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def calculate_commissions
    self.assembler_commission = value * (Setup.first.assembler_commission)/100
    self.manager_commission = value * (Setup.first.manager_commission)/100
---
SELECT "setups".* FROM "setups" ORDER BY "setups"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def calculate_other_values
    self.shipping_cost = factory_cost * (Setup.first.shipping_cost)/100
    self.reserve_cost = value * (Setup.first.reserve_cost)/100
---
SELECT "setups".* FROM "setups" ORDER BY "setups"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def calculate_taxs
      self.tax = value * (Setup.first.tax)/100
---
SELECT "setups".* FROM "setups" ORDER BY "setups"."id" ASC LIMIT ?  [["LIMIT", 1]]