backend/app/controllers/quotations_controller.rb

  def index
    @quotations = Quotation.all
---
SELECT "quotations".* FROM "quotations"

  def create
    @quotation = Quotation.new(quotation_params)

    if @quotation.save
---
INSERT INTO "quotations" ("name", "value", "factory_cost", "reserve_cost", "installments", "discount", "tax", "manager_commission", "assembler_commission", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update

    if @quotation.update(quotation_params)
---
UPDATE "quotations" SET "value" = ?, "reserve_cost" = ?, "tax" = ?, "manager_commission" = ?, "assembler_commission" = ?, "updated_at" = ? WHERE "quotations"."id" = ?  [["value", 50000.0], ["reserve_cost", 1500.0], ["tax", 1375.0], ["manager_commission", 1500.0], ["assembler_commission", 5000.0], ["updated_at", "2021-08-27 00:35:26.869025"], ["id", 2]]

  def destroy
    @quotation.destroy
---
DELETE FROM "quotations" WHERE "quotations"."id" = ?  [["id", 10]]

  def set_quotation
    @quotation = Quotation.find(params[:id])
---
SELECT "quotations".* FROM "quotations" WHERE "quotations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]