app/controllers/api/v1/quotations_controller.rb

  def index
    @quotations = Quotation.all
---
SELECT "quotations".* FROM "quotations"

  def create
    @quotation = Quotation.new(quotation_params)

    if @quotation.save
---
INSERT INTO "quotations" ("name", "value", "factory_cost", "reserve_cost", "installments", "tax", "manager_commission", "assembler_commission", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)